# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet..::..Clear Method
WireConduitTypeSet Class See Also
---
Removes every conduit type from the set, rendering it empty.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Clear()
```

Visual Basic
---
```text
Public Overridable Sub Clear
```

Visual C++
---
```text
public:
virtual void Clear()
```

# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace